{
  "message_id": 58,
  "questions": [
    {
      "number": 1,
      "text": "When you sit down at a coffee shop to work, what's your go-to order — and does it change based on time of day or weather?",
      "category": "beverages",
      "type": "enrich",
      "target_file": "coffee-orders.md"
    },
    {
      "number": 2,
      "text": "Are you actively studying Spanish right now, and if so, how? (App, tutor, immersion, classes — and how many minutes a day roughly?)",
      "category": "languages",
      "type": "enrich",
      "target_file": "study-habits.md"
    },
    {
      "number": 3,
      "text": "When you're buying something new, how much does a brand's sustainability record actually influence your decision — is it a dealbreaker, a tiebreaker, or more of a nice-to-have?",
      "category": "sustainability",
      "type": "enrich",
      "target_file": "purchasing-decisions.md"
    },
    {
      "number": 4,
      "text": "How would you describe your current wardrobe vibe in 3 words, and is there a brand or two you'd point to as 'this is exactly my style'?",
      "category": "fashion",
      "type": "enrich",
      "target_file": "brands.md"
    },
    {
      "number": 5,
      "text": "When you need to buy something, how long do you typically research before pulling the trigger — are you a quick-buy person or do you spend days comparing options?",
      "category": "shopping",
      "type": "enrich",
      "target_file": "decision-process.md"
    },
    {
      "number": 6,
      "text": "Outside of volleyball, what does a typical week of movement look like for you — any strength training, running, swimming, or stretching built into your routine?",
      "category": "fitness",
      "type": "enrich",
      "target_file": "weekly-routine.md"
    },
    {
      "number": 7,
      "text": "If someone wanted to give you the perfect gift for your birthday, what's one thing you'd actually be excited to receive — and one category of gift you'd rather they skip entirely?",
      "category": "gifts",
      "type": "enrich",
      "target_file": "wishlist.md"
    },
    {
      "number": 8,
      "text": "As a digital nomad, how do you currently get around day-to-day in Mexico — walking, scooter, ride-share, bike? And when you're in the US, what's your transportation setup?",
      "category": "vehicles",
      "type": "enrich",
      "target_file": "daily-transport.md"
    },
    {
      "number": 9,
      "text": "What does your ideal workspace look like at home — standing desk, couch, kitchen table? And how important is it that your living space has a dedicated work area?",
      "category": "home-decor",
      "type": "enrich",
      "target_file": "workspace.md"
    },
    {
      "number": 10,
      "text": "For Remi — what's her breed, how old is she, and what does her daily care routine look like (walks, feeding schedule, vet cadence)?",
      "category": "pets",
      "type": "enrich",
      "target_file": "remi.md"
    },
    {
      "number": 11,
      "text": "What does a social week look like when you feel like things are dialed in — how many days do you want to be doing something with others vs. having fully solo evenings?",
      "category": "social",
      "type": "enrich",
      "target_file": "cadence.md"
    },
    {
      "number": 12,
      "text": "What's your morning like before you open your laptop — do you have a consistent ritual, or does it vary day to day?",
      "category": "daily-routine",
      "type": "enrich",
      "target_file": "morning.md"
    },
    {
      "number": 13,
      "text": "When you're in a focused work session, what are you listening to — specific playlists, a particular artist, lo-fi, silence, or something else entirely?",
      "category": "music",
      "type": "enrich",
      "target_file": "focus-listening.md"
    },
    {
      "number": 14,
      "text": "Do you have any supplements or vitamins you take daily? If so, what's your current stack and why did you land on those?",
      "category": "health",
      "type": "enrich",
      "target_file": "supplements.md"
    },
    {
      "number": 15,
      "text": "When you're not actively building something for work, what hobby or side project gives you the most energy right now?",
      "category": "entertainment",
      "type": "enrich",
      "target_file": "active-hobbies.md"
    },
    {
      "number": 16,
      "text": "How do you handle eating out — do you have a go-to set of restaurants you rotate through, or do you explore somewhere new most of the time? And how often do you eat out vs. cook in a typical week?",
      "category": "food",
      "type": "enrich",
      "target_file": "dining-out.md"
    },
    {
      "number": 17,
      "text": "Tell me about your relationship with alcohol — do you drink, and if so, what are your go-to drinks and in what contexts?",
      "category": "beverages",
      "type": "enrich",
      "target_file": "alcohol.md"
    },
    {
      "number": 18,
      "text": "What does your approach to money look like when you're traveling — do you budget trip costs tightly, spend freely, or something in between? And what's the one travel expense you'd never cheap out on?",
      "category": "travel",
      "type": "enrich",
      "target_file": "travel-spending.md"
    },
    {
      "number": 19,
      "text": "What's your relationship with cooking? Do you enjoy it as a creative outlet, treat it as a necessary chore, or something in between — and are there specific cuisines or dishes you like to make?",
      "category": "food",
      "type": "enrich",
      "target_file": "cooking-enjoyment.md"
    },
    {
      "number": 20,
      "text": "What's your general approach to personal health care — do you go to doctors proactively, only when something feels wrong, or do you handle most things with lifestyle choices and avoid the medical system when possible?",
      "category": "health",
      "type": "enrich",
      "target_file": "medical-philosophy.md"
    }
  ],
  "sent_at": "2026-03-01T02:47:18.078760+00:00"
}
